In [21]:
import pandas as pd

df = pd.read_csv('../data/credit_scoring.csv')
df.head()

,application_id,age,monthly_income,loan_amount,previous_defaults,credit_score,default,leak_col_good,leak_col_subtle
0,501000,41,13995609,5982664,0,624,0,0,-0.040
1,501001,58,13683833,3711198,0,809,0,0,0.001
2,501002,33,9417391,7172332,0,647,0,0,0.077
3,501003,45,6861811,8661056,0,450,0,0,0.038
4,501004,22,5640742,4520669,1,816,0,0,0.020

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6000 entries, 0 to 5999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   application_id     6000 non-null   int64
 1   age                6000 non-null   int64
 2   monthly_income     6000 non-null   int64
 3   loan_amount        6000 non-null   int64
 4   previous_defaults  6000 non-null   int64
 5   credit_score       6000 non-null   int64
 6   default            6000 non-null   int64
 7   leak_col_good      6000 non-null   int64
 8   leak_col_subtle    6000 non-null   float64
dtypes: float64(1), int64(8)
memory usage: 422.0 KB

In [23]:
# Check for missing values
df.isnull().sum()

application_id       0
age                  0
monthly_income       0
loan_amount          0
previous_defaults    0
credit_score         0
default              0
leak_col_good        0
leak_col_subtle      0
dtype: int64

In [24]:
df.describe()

,application_id,age,monthly_income,loan_amount,previous_defaults,credit_score,default,leak_col_good,leak_col_subtle
count,6000.000000,6000.000000,6.000000e+03,6.000000e+03,6000.000000,6000.000000,6000.000000,6000.000000,6000.000000
mean,503999.500000,40.321500,1.140386e+07,8.001122e+06,0.243667,575.979833,0.012167,0.012167,0.011945
std,1732.195139,11.300697,4.912598e+06,4.071786e+06,0.484767,158.328931,0.109639,0.109639,0.113947
min,501000.000000,21.000000,3.000310e+06,1.000794e+06,0.000000,300.000000,0.000000,0.000000,-0.119000
25%,502499.750000,31.000000,7.163379e+06,4.440939e+06,0.000000,438.750000,0.000000,0.000000,-0.020000
50%,503999.500000,41.000000,1.129945e+07,7.982304e+06,0.000000,577.500000,0.000000,0.000000,0.000000
75%,505499.250000,50.000000,1.573705e+07,1.153144e+07,0.000000,713.000000,0.000000,0.000000,0.021000
max,506999.000000,59.000000,1.998622e+07,1.499858e+07,3.000000,849.000000,1.000000,1.000000,1.092000

In [25]:
# Check for duplicates
print("Number of unique application id: ", df.application_id.nunique())

Number of unique application id:  6000

In [26]:
# Drop application_id and data-leakage columns ('leak_col_good', 'leak_col_subtle')
df = df.drop(columns=['application_id', 'leak_col_good', 'leak_col_subtle'])
df.head()

   age  monthly_income  loan_amount  previous_defaults  credit_score  default
0   41        13995609      5982664                  0           624        0
1   58        13683833      3711198                  0           809        0
2   33         9417391      7172332                  0           647        0
3   45         6861811      8661056                  0           450        0
4   22         5640742      4520669                  1           816        0

# EDA

## Check unique value each column

In [27]:
df['age'].unique()

array([41, 58, 33, 45, 22, 35, 38, 25, 46, 50, 34, 28, 26, 24, 55, 47, 31,
       57, 53, 43, 27, 52, 29, 36, 48, 32, 39, 56, 42, 37, 51, 21, 49, 30,
       59, 54, 23, 44, 40])

In [28]:
df['monthly_income'].unique()

array([13995609, 13683833,  9417391, ...,  9048532,  6843160, 12715733],
      shape=(6000,))

In [29]:
df['loan_amount'].unique()

array([ 5982664,  3711198,  7172332, ..., 14760384, 11774594,  8006387],
      shape=(6000,))

In [30]:
df['previous_defaults'].unique()

array([0, 1, 2, 3])

In [31]:
df['credit_score'].unique()

array([624, 809, 647, 450, 816, 642, 515, 807, 636, 422, 535, 353, 671,
       388, 834, 579, 572, 742, 508, 417, 318, 652, 402, 433, 474, 803,
       438, 327, 405, 546, 432, 585, 389, 355, 412, 768, 800, 311, 434,
       530, 824, 810, 761, 519, 381, 431, 339, 547, 350, 482, 460, 594,
       451, 638, 618, 533, 615, 665, 653, 777, 351, 778, 356, 409, 561,
       780, 491, 725, 697, 396, 466, 792, 633, 590, 398, 467, 793, 832,
       490, 534, 483, 414, 692, 364, 360, 514, 376, 776, 608, 343, 611,
       649, 322, 658, 696, 614, 549, 384, 369, 625, 470, 722, 301, 818,
       812, 308, 772, 394, 421, 741, 604, 833, 543, 559, 392, 365, 841,
       635, 836, 454, 648, 423, 674, 367, 678, 779, 664, 663, 461, 794,
       805, 386, 726, 620, 312, 666, 556, 472, 373, 441, 729, 400, 511,
       346, 695, 763, 407, 840, 342, 672, 316, 553, 390, 655, 486, 683,
       383, 757, 314, 309, 759, 710, 745, 310, 523, 698, 498, 563, 493,
       429, 632, 820, 375, 303, 330, 340, 477, 602, 639, 705, 577, 784,
       328, 558, 837, 764, 479, 786, 463, 569, 349, 783, 680, 626, 718,
       849, 588, 630, 525, 689, 445, 458, 595, 811, 730, 813, 631, 703,
       668, 372, 344, 584, 659, 548, 313, 357, 332, 371, 684, 623, 401,
       610, 480, 379, 645, 838, 446, 782, 679, 607, 506, 362, 552, 540,
       677, 622, 336, 770, 524, 751, 845, 676, 613, 484, 541, 345, 370,
       326, 449, 749, 497, 410, 599, 578, 597, 494, 537, 712, 501, 686,
       321, 774, 495, 690, 424, 505, 550, 795, 455, 426, 621, 758, 509,
       743, 724, 544, 830, 347, 393, 395, 598, 488, 822, 408, 348, 516,
       539, 831, 471, 571, 682, 704, 437, 828, 567, 716, 591, 814, 756,
       473, 564, 377, 733, 650, 411, 352, 619, 760, 538, 673, 406, 337,
       701, 374, 575, 605, 815, 565, 592, 504, 435, 427, 748, 528, 554,
       603, 740, 532, 609, 404, 627, 387, 593, 300, 513, 419, 847, 787,
       440, 702, 439, 536, 385, 542, 601, 581, 531, 688, 570, 366, 334,
       329, 576, 517, 765, 835, 773, 612, 485, 380, 529, 769, 844, 667,
       791, 687, 315, 600, 430, 518, 562, 848, 675, 359, 654, 363, 502,
       728, 723, 669, 436, 507, 790, 526, 817, 616, 447, 798, 500, 797,
       399, 317, 453, 643, 734, 700, 522, 715, 640, 709, 641, 481, 719,
       842, 755, 753, 657, 747, 324, 660, 799, 839, 457, 527, 801, 487,
       750, 713, 459, 738, 825, 720, 735, 732, 478, 361, 448, 580, 721,
       681, 662, 456, 319, 341, 752, 717, 469, 568, 644, 304, 788, 305,
       413, 397, 555, 685, 617, 775, 606, 557, 468, 551, 499, 320, 829,
       560, 819, 425, 691, 302, 827, 391, 521, 766, 566, 492, 416, 444,
       333, 731, 634, 510, 338, 762, 335, 789, 382, 711, 707, 496, 846,
       583, 637, 651, 646, 699, 331, 503, 708, 489, 520, 443, 771, 442,
       403, 323, 586, 378, 746, 843, 476, 808, 462, 354, 785, 418, 806,
       737, 804, 475, 428, 661, 736, 767, 587, 694, 464, 512, 823, 739,
       415, 452, 826, 574, 656, 358, 781, 545, 744, 307, 573, 802, 821,
       596, 589, 670, 693, 706, 306, 628, 796, 325, 629, 714, 727, 754,
       420, 368, 582, 465])

In [32]:
df['default'].unique()

array([0, 1])

In [33]:
df.describe()

,age,monthly_income,loan_amount,previous_defaults,credit_score,default
count,6000.000000,6.000000e+03,6.000000e+03,6000.000000,6000.000000,6000.000000
mean,40.321500,1.140386e+07,8.001122e+06,0.243667,575.979833,0.012167
std,11.300697,4.912598e+06,4.071786e+06,0.484767,158.328931,0.109639
min,21.000000,3.000310e+06,1.000794e+06,0.000000,300.000000,0.000000
25%,31.000000,7.163379e+06,4.440939e+06,0.000000,438.750000,0.000000
50%,41.000000,1.129945e+07,7.982304e+06,0.000000,577.500000,0.000000
75%,50.000000,1.573705e+07,1.153144e+07,0.000000,713.000000,0.000000
max,59.000000,1.998622e+07,1.499858e+07,3.000000,849.000000,1.000000